itsmrma/STM32CentralinaGettiniWiFI/Application/User/main.c
                    HAL_SuspendTick();
                    HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);

                    // --- IL SISTEMA È CONGELATO QUI ---

                    // --- RISVEGLIO ---
                    SystemClock_Config();
                    HAL_ResumeTick();

                    // Riattiviamo l'interrupt del Wi-Fi
                    HAL_NVIC_EnableIRQ(EXTI1_IRQn);
                    HAL_Delay(300); // Fondamentale: diamo tempo all'hardware SPI di riprendersi

                    LOG((">>>Risveglio da STOP Mode. Server di nuovo online.\n"));

                    // 2. Sincronizziamo l'orario PRIMA di riaprire il Server
                    // In questo modo evitiamo che il chip Wi-Fi debba gestire il Socket 0 (Server)
                    // e il Socket 1 (Client Google) contemporaneamente appena sveglio.
                    UpdateTimeHTTP(&orario);

                    HAL_Delay(500);

                    // 3. ORA riapriamo il Server Web
                    if (WIFI_StartServer(SOCKET, WIFI_TCP_PROTOCOL, 1, "", PORT) == WIFI_STATUS_OK) {
                        LOG(("Server riaperto con successo.\n"));
                    } else {
                        LOG(("ATTENZIONE: Errore riapertura Server.\n"));
                    }

                    // Resetta il timer e riparti
                    last_http_activity = HAL_GetTick();
                    continue;
                }

        // 2. GESTIONE SERVER E IRRIGAZIONE (Quando è sveglio)
        uint8_t RemoteIP[4];
        uint16_t RemotePort;

        if (HAL_GetTick() - last_second_tick >= 1000) {
            last_second_tick += 1000;
            IncrementTime();
            ApplyIrrigationControl();
        }

        if (HAL_GetTick() - last_sync_tick >= sync_interval) {
            LOG(("\n--- Auto Sync ---\n"));
            UpdateTimeHTTP(&orario);
            CheckWeatherForecast();
            UpdateIrrigationLogic();
            RefreshSystemState();
            last_sync_tick = HAL_GetTick();
        }

        // In modalità normale ascoltiamo la rete
        if (WIFI_STATUS_OK == WIFI_WaitServerConnection(SOCKET, 1000, RemoteIP, sizeof(RemoteIP), &RemotePort)) {
            last_http_activity = HAL_GetTick(); // Client connesso: resetta il timer di inattività!
            StopServer = WebServerProcess();
            WIFI_CloseServerConnection(SOCKET);
            HAL_Delay(500);
        }

    } while(StopServer == false);

  WIFI_StopServer(SOCKET);
  return 0;
}

static bool WebServerProcess(void)
{
    uint16_t respLen;
    static uint8_t resp[1024];
    bool stopserver = false;

    if (WIFI_STATUS_OK == WIFI_ReceiveData(SOCKET, resp, 1000, &respLen, WIFI_READ_TIMEOUT))
    {
        if (respLen > 0)
        {
            if (respLen < 1024) resp[respLen] = '\0'; else resp[1023] = '\0';

            if (strstr((char *)resp, "GET")) {
                SendWebPage();
            }
            else if (strstr((char *)resp, "POST")) {
                LOG(("POST Ricevuto. Aggiorno configurazione...\n"));
                char *p;

                p = strstr((char *)resp, "cfg_hour=");
                if (p) cfg_start_hour = atoi(p + 9);

                p = strstr((char *)resp, "cfg_dur=");
                if (p) cfg_duration_min = atoi(p + 8);

                // --- NUOVO PARSING SMART MODE ---
                if (strstr((char *)resp, "smart_active=1")) {
                    smart_mode_active = 1;
                } else {
                    smart_mode_active = 0;
                }

                char *p_smart = strstr((char *)resp, "smart_th=");
                if (p_smart) smart_threshold = atoi(p_smart + 9);
                // -------------------------------

                cfg_days_mask = 0;
                if (strstr((char *)resp, "day_0=1")) cfg_days_mask |= (1<<0);
                if (strstr((char *)resp, "day_1=1")) cfg_days_mask |= (1<<1);
                if (strstr((char *)resp, "day_2=1")) cfg_days_mask |= (1<<2);
                if (strstr((char *)resp, "day_3=1")) cfg_days_mask |= (1<<3);
                if (strstr((char *)resp, "day_4=1")) cfg_days_mask |= (1<<4);
                if (strstr((char *)resp, "day_5=1")) cfg_days_mask |= (1<<5);
                if (strstr((char *)resp, "day_6=1")) cfg_days_mask |= (1<<6);

                if (strstr((char *)resp, "sim_mode=1")) {
                    sim_mode_active = 1;
                    p = strstr((char *)resp, "sim_rain=");
                    if (p) sim_rain_prob = atoi(p + 9);
                } else {
                    sim_mode_active = 0;
                }

                RefreshSystemState();
                ApplyIrrigationControl();
                SaveSettings();
                SendWebPage();
            }
        }
    }
    return stopserver;
}

void UpdateIrrigationLogic(void) {
    int prob_to_check = (sim_mode_active) ? sim_rain_prob : real_rain_prob;
    if(prob_to_check == -1) prob_to_check = 0;

    if (prob_to_check > 60) {
        if(skip_irrigation == 0) LOG(("LOGICA: Pioggia alta (%d%%) -> STOP Irrigazione\n", prob_to_check));
        skip_irrigation = 1;
    } else {
        if(skip_irrigation == 1) LOG(("LOGICA: Pioggia bassa (%d%%) -> OK Irrigazione\n", prob_to_check));
        skip_irrigation = 0;
    }
}

// Funzione per aggiornare sensori e logica decisionale
// Va chiamata nella sincronizzazione oraria e subito dopo aver ricevuto un POST
void RefreshSystemState(void) {
    // 1. Lettura Sensori (per avere dati freschi su Score e Dashboard)
    float current_T = BSP_TSENSOR_ReadTemp();
    float current_H = BSP_HSENSOR_ReadHumidity();
    float current_P = BSP_PSENSOR_ReadPressure();

    // 2. Calcolo Logica Temporale (Oggi vs Domani)
    int irrigation_end_minute = cfg_start_hour * 60 + cfg_duration_min;
    int current_minute_abs = orario.hours * 60 + orario.minutes;

    if (current_minute_abs >= irrigation_end_minute) {
        is_showing_tomorrow = 1;
        real_rain_prob = buf_rain_tomorrow;
    } else {
        is_showing_tomorrow = 0;
        real_rain_prob = buf_rain_today;
    }

